
Функция ПолучитьТипОчереди(ОчередьСсылка) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	осОчередиСообщений.ТипОчереди КАК ТипОчереди
		|ИЗ
		|	Справочник.осОчередиСообщений КАК осОчередиСообщений
		|ГДЕ
		|	осОчередиСообщений.Ссылка = &ОчередьСсылка
		|	И НЕ осОчередиСообщений.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ОчередьСсылка", ОчередьСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат Неопределено;
	КонецЕсли;	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	Возврат	ВыборкаДетальныеЗаписи.ТипОчереди;
		
КонецФункции

