
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
	//	Объект.Тип = ПредопределенноеЗначение("Перечисление.осТипыОчередей.РегистрацияСобытий");
	КонецЕсли;
	
	//Если Объект.Тип = ПредопределенноеЗначение("Перечисление.осТипыДействий.Пользовательский") Тогда
	//	Элементы.СтраницыШаблонов.ТекущаяСтраница = Элементы.СтраницаШаблоныФильтров;
	//Иначе
	//	Элементы.СтраницыШаблонов.ТекущаяСтраница = Элементы.СтраницаШаблоныДействий;
	//КонецЕсли;
	      
КонецПроцедуры

&НаСервере
Процедура ТипОчередиПриИзмененииНаСервере()
	
	Объект.ШаблоныДействий.Очистить();
	Объект.ШаблоныФильтров.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипОчередиПриИзменении(Элемент)
	
	ТипОчередиПриИзмененииНаСервере();
	Если Объект.Тип = ПредопределенноеЗначение("Перечисление.осТипыОчередей.РегистрацияСобытий") Тогда
		Элементы.СтраницыШаблонов.ТекущаяСтраница = Элементы.СтраницаШаблоныФильтров;
	Иначе
		Элементы.СтраницыШаблонов.ТекущаяСтраница = Элементы.СтраницаШаблоныДействий;
	КонецЕсли;
	
КонецПроцедуры
