
Процедура ПередЗаписью(Отказ)
	
	//ХешШаблонаФильтра = осОчередиСообщенийСервер.ВычислитьХешШаблонаФильтра(ОписаниеШаблонаФильтра);
	
КонецПроцедуры

//Процедура ПриКопировании(ОбъектКопирования)
//	
//	Фильтр = ОбъектКопирования.ЗначениеПравилаФильтрации;
//	ПараметрыФильтра = Новый ХранилищеЗначения(ОбъектКопирования.НастройкиПравилаФильтрации.Получить());
//	
//	ПараметрыДействия = Новый ХранилищеЗначения(ОбъектКопирования.ПараметрыДействия.Получить());
//	Идентификатор = Неопределено;
//	
//КонецПроцедуры

