Процедура ПередЗаписью(Отказ)
	
	РезультатПроверки = осОчередиСообщенийВызовСервера.ПроверитьСтрокуНаСоответствиеМаске(Код);
	Если РезультатПроверки.ЕстьОшибка Тогда
		Отказ = Истина;
		ВызватьИсключение РезультатПроверки.ОписаниеОшибки;
	КонецЕсли; 	
	
КонецПроцедуры  

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив();
	
//	Если Тип = ПредопределенноеЗначение("Перечисление.осТипыОчередей.РегистрацияСобытий") Тогда
		НепроверяемыеРеквизиты.Добавить("ШаблоныДействий"); 
//	Иначе
		НепроверяемыеРеквизиты.Добавить("ШаблоныФильтров"); 
//	КонецЕсли;
		
	УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура УдалитьНепроверяемыеРеквизитыИзМассива(МассивРеквизитов, МассивНепроверяемыхРеквизитов) Экспорт

  Для Каждого ЭлементМассива Из МассивНепроверяемыхРеквизитов Цикл
 
    ПорядковыйНомер = МассивРеквизитов.Найти(ЭлементМассива);
    Если ПорядковыйНомер <> Неопределено Тогда
      МассивРеквизитов.Удалить(ПорядковыйНомер);
    КонецЕсли;
 
  КонецЦикла;
 
КонецПроцедуры